<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/68681277-41b0-4610-9248-fc482756e75a/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created
  + resource "aws_appautoscaling_policy" "ecs_target_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + role_arn           = "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_ecs_service.app_service will be created
  + resource "aws_ecs_service" "app_service" {
      + cluster                            = "arn:aws:ecs:eu-central-1:898587786287:cluster/staging_keyserver_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "staging_keyserver-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = true

      + load_balancer {
          + container_name   = "staging_keyserver"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-1ca/46a7d07629739726"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-006f9fc131af3565e",
              + "subnet-05894f2d41c0e8b45",
              + "subnet-06557bf48886434f1",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.app_task will be created
  + resource "aws_ecs_task_definition" "app_task" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"
      + family                   = "staging_keyserver"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_lb.load_balancer will be updated in-place
  ~ resource "aws_lb" "load_balancer" {
        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-staging-keyserver-d4e/5d5f284061ee67df"
        name                             = "staging-staging-keyserver-d4e"
      ~ security_groups                  = [
          - "sg-0fdb5104bf67271b6",
        ] -> (known after apply)
        tags                             = {}
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object 46e9632d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - arn_suffix                         = "targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - name                               = "staging-keyserver-7ab" -> null
      - port                               = 8080 -> null
      - preserve_client_ip                 = "false" -> null
      - protocol                           = "TCP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 10 -> null
          - matcher             = "200-399" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 6 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object e1509152) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - arn_suffix                         = "targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "staging-staging-keyserver-8e5" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 30 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 15 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "80" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object e84c2cb9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - arn_suffix                         = "targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "staging-keyserver-b26" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 30 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 15 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "8080" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.ecs.aws_security_group.app_ingress must be replaced
+/- resource "aws_security_group" "app_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-06d860f341a56e506" -> (known after apply)
      ~ id                     = "sg-06d860f341a56e506" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0fdb5104bf67271b6",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
      ~ name                   = "staging-keyserver-66d-app-ingress" # forces replacement -> (known after apply) # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 15988ebd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0b7723d9d0a19b655" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0b7723d9d0a19b655" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f1661854871685a5",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-keyserver-app-ingress-b9b" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 30041f82) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-07237821707d8552f" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-07237821707d8552f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0e775953e2d0059a0",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-e0b" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 343bcef7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0dae7acb1fc5a8b00" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0dae7acb1fc5a8b00" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f9a385f74165e34c",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-212" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 8ce2b8fc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0bc18f1f55f7feef3" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0bc18f1f55f7feef3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-06c64e4d9a8dc24ad",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-f25" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 999d9d41) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-052baef3342b8d9f9" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-052baef3342b8d9f9" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0476ae0a70f2b39bd",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-6a1" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object e47de569) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0957ca2b3b7d67efb" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0957ca2b3b7d67efb" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0920046fe037e6133",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-5ba" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress must be replaced
+/- resource "aws_security_group" "lb_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0fdb5104bf67271b6" -> (known after apply)
      ~ id                     = "sg-0fdb5104bf67271b6" -> (known after apply)
      ~ name                   = "staging-keyserver-66d-lb-ingress" # forces replacement -> (known after apply) # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object 8c150c41) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0476ae0a70f2b39bd" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0476ae0a70f2b39bd" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-888" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object a353e579) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0920046fe037e6133" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0920046fe037e6133" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-1b7" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object ac15d8c7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0f1661854871685a5" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f1661854871685a5" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-keyserver-lb-ingress-ed6" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object b220dee6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-06c64e4d9a8dc24ad" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-06c64e4d9a8dc24ad" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-7b7" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object f19326a9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0e775953e2d0059a0" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0e775953e2d0059a0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-361" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object fb7f2d77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0f9a385f74165e34c" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f9a385f74165e34c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-4bf" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

Plan: 7 to add, 1 to change, 17 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created%0A  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "application-scaling-policy-cpu"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in = false%0A          + target_value     = 80%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created%0A  + resource "aws_appautoscaling_policy" "ecs_target_memory" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "application-scaling-policy-memory"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in = false%0A          + target_value     = 80%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be created%0A  + resource "aws_appautoscaling_target" "ecs_target" {%0A      + id                 = (known after apply)%0A      + max_capacity       = 8%0A      + min_capacity       = 2%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + role_arn           = "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be created%0A  + resource "aws_ecs_service" "app_service" {%0A      + cluster                            = "arn:aws:ecs:eu-central-1:898587786287:cluster/staging_keyserver_cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "staging_keyserver-service"%0A      + platform_version                   = (known after apply)%0A      + propagate_tags                     = "TASK_DEFINITION"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = true%0A%0A      + load_balancer {%0A          + container_name   = "staging_keyserver"%0A          + container_port   = 8080%0A          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-1ca/46a7d07629739726"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = [%0A              + "subnet-006f9fc131af3565e",%0A              + "subnet-05894f2d41c0e8b45",%0A              + "subnet-06557bf48886434f1",%0A            ]%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task will be created%0A  + resource "aws_ecs_task_definition" "app_task" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = (sensitive value)%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"%0A      + family                   = "staging_keyserver"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + task_role_arn            = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"%0A%0A      + runtime_platform {%0A          + operating_system_family = "LINUX"%0A        }%0A    }%0A%0A  # module.ecs.aws_lb.load_balancer will be updated in-place%0A  ~ resource "aws_lb" "load_balancer" {%0A        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-staging-keyserver-d4e/5d5f284061ee67df"%0A        name                             = "staging-staging-keyserver-d4e"%0A      ~ security_groups                  = [%0A          - "sg-0fdb5104bf67271b6",%0A        ] -> (known after apply)%0A        tags                             = {}%0A        # (17 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object 46e9632d) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - arn_suffix                         = "targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "30" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - name                               = "staging-keyserver-7ab" -> null%0A      - port                               = 8080 -> null%0A      - preserve_client_ip                 = "false" -> null%0A      - protocol                           = "TCP" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 0 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 10 -> null%0A          - matcher             = "200-399" -> null%0A          - path                = "/health" -> null%0A          - port                = "traffic-port" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 6 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 0 -> null%0A          - enabled         = false -> null%0A          - type            = "source_ip" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object e1509152) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - arn_suffix                         = "targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - name                               = "staging-staging-keyserver-8e5" -> null%0A      - port                               = 80 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 30 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 15 -> null%0A          - matcher             = "200" -> null%0A          - path                = "/health" -> null%0A          - port                = "80" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 10 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 86400 -> null%0A          - enabled         = false -> null%0A          - type            = "lb_cookie" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object e84c2cb9) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - arn_suffix                         = "targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - name                               = "staging-keyserver-b26" -> null%0A      - port                               = 8080 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 30 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 15 -> null%0A          - matcher             = "200" -> null%0A          - path                = "/health" -> null%0A          - port                = "8080" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 10 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 86400 -> null%0A          - enabled         = false -> null%0A          - type            = "lb_cookie" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_security_group.app_ingress must be replaced%0A+/- resource "aws_security_group" "app_ingress" {%0A      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-06d860f341a56e506" -> (known after apply)%0A      ~ id                     = "sg-06d860f341a56e506" -> (known after apply)%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-0fdb5104bf67271b6",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = []%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 0%0A            },%0A            # (1 unchanged element hidden)%0A        ]%0A      ~ name                   = "staging-keyserver-66d-app-ingress" # forces replacement -> (known after apply) # forces replacement%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "898587786287" -> (known after apply)%0A      - tags                   = {} -> null%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_security_group.app_ingress (deposed object 15988ebd) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_security_group" "app_ingress" {%0A      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0b7723d9d0a19b655" -> null%0A      - description            = "Allow app port ingress" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0b7723d9d0a19b655" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.192.0.0/16",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          - {%0A              - cidr_blocks      = []%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-0f1661854871685a5",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - name                   = "staging-keyserver-app-ingress-b9b" -> null%0A      - owner_id               = "898587786287" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - vpc_id                 = "vpc-09dce0b23af575478" -> null%0A    }%0A%0A  # module.ecs.aws_security_group.app_ingress (deposed object 30041f82) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_security_group" "app_ingress" {%0A      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-07237821707d8552f" -> null%0A      - description            = "Allow app port ingress" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-07237821707d8552f" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.192.0.0/16",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          - {%0A              - cidr_blocks      = []%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-0e775953e2d0059a0",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - name                   = "staging-staging-keyserver-app-ingress-e0b" -> null%0A      - owner_id               = "898587786287" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - vpc_id                 = "vpc-09dce0b23af575478" -> null%0A    }%0A%0A 
...

```

</details>

*Action: `pull_request`*